---
title: "draft"
author: "최규빈"
date: "09/20/2023"
categories:
  - plotnine
draft: true
---

# 4. Pandas: query

In [226]:
df=pd.DataFrame(np.random.normal(size=(20,4)),columns=list('ABCD'),index=pd.date_range('20221226',periods=20)).assign(E=['A']*10+['B']*10)
df

                   A         B         C         D  E
2022-12-26  1.817794  0.688123 -1.015092  2.010119  A
2022-12-27  0.835070  1.263637  0.341315 -1.010957  A
2022-12-28 -0.950937 -0.419994 -1.241818  0.336441  A
2022-12-29 -1.253486  1.613174  0.974001 -1.329818  A
2022-12-30  0.632094  0.787459 -0.043460  0.590284  A
2022-12-31 -0.008297  1.336190  0.832503 -0.816102  A
2023-01-01  0.080573  0.363952 -0.094476  0.896589  A
2023-01-02 -0.553000  0.641742  2.100417  0.314088  A
2023-01-03  0.601046 -0.601035  1.388087  1.454556  A
2023-01-04 -0.924704  0.327637 -1.006630  1.657376  A
2023-01-05 -0.419960 -0.991624  0.984064  0.571863  B
2023-01-06 -0.393774  1.063387 -0.864032  0.932810  B
2023-01-07  1.042991  0.071130  1.038573 -1.337250  B
2023-01-08 -0.924976 -0.792420 -0.867050 -1.399181  B
2023-01-09  0.055362 -0.392051 -0.316035 -0.175286  B
2023-01-10  0.059772 -1.114924 -0.470883  0.801841  B
2023-01-11  0.299772  0.871334 -1.037732 -0.245415  B
2023-01-12 -1.014341 -0.446765 -1.749381 -0.127599  B
2023-01-13 -0.747640  0.948013 -0.151061  2.525866  B
2023-01-14 -0.200503  0.565430  0.636693  1.211201  B

## A. 기본 query

`-` 예시1: `A>0 and B<0`

In [227]:
df.query('A>0 and B<0')

                   A         B         C         D  E
2023-01-03  0.601046 -0.601035  1.388087  1.454556  A
2023-01-09  0.055362 -0.392051 -0.316035 -0.175286  B
2023-01-10  0.059772 -1.114924 -0.470883  0.801841  B

`-` 예시2: `A<B<C`

In [228]:
df.query('A<B<C')

                   A         B         C         D  E
2023-01-02 -0.553000  0.641742  2.100417  0.314088  A
2023-01-14 -0.200503  0.565430  0.636693  1.211201  B

`-` 예시3: `(A+B/2) > 0`

In [229]:
df.query('(A+B)>0')

                   A         B         C         D  E
2022-12-26  1.817794  0.688123 -1.015092  2.010119  A
2022-12-27  0.835070  1.263637  0.341315 -1.010957  A
2022-12-29 -1.253486  1.613174  0.974001 -1.329818  A
2022-12-30  0.632094  0.787459 -0.043460  0.590284  A
2022-12-31 -0.008297  1.336190  0.832503 -0.816102  A
2023-01-01  0.080573  0.363952 -0.094476  0.896589  A
2023-01-02 -0.553000  0.641742  2.100417  0.314088  A
2023-01-03  0.601046 -0.601035  1.388087  1.454556  A
2023-01-06 -0.393774  1.063387 -0.864032  0.932810  B
2023-01-07  1.042991  0.071130  1.038573 -1.337250  B
2023-01-11  0.299772  0.871334 -1.037732 -0.245415  B
2023-01-13 -0.747640  0.948013 -0.151061  2.525866  B
2023-01-14 -0.200503  0.565430  0.636693  1.211201  B

`-` 예시4: `(A+B/2) > 0` and `E=='A'`

In [230]:
df.query('(A+B)>0 and E=="A"')

                   A         B         C         D  E
2022-12-26  1.817794  0.688123 -1.015092  2.010119  A
2022-12-27  0.835070  1.263637  0.341315 -1.010957  A
2022-12-29 -1.253486  1.613174  0.974001 -1.329818  A
2022-12-30  0.632094  0.787459 -0.043460  0.590284  A
2022-12-31 -0.008297  1.336190  0.832503 -0.816102  A
2023-01-01  0.080573  0.363952 -0.094476  0.896589  A
2023-01-02 -0.553000  0.641742  2.100417  0.314088  A
2023-01-03  0.601046 -0.601035  1.388087  1.454556  A

In [231]:
df.query("(A+B)>0 and E=='A'")

                   A         B         C         D  E
2022-12-26  1.817794  0.688123 -1.015092  2.010119  A
2022-12-27  0.835070  1.263637  0.341315 -1.010957  A
2022-12-29 -1.253486  1.613174  0.974001 -1.329818  A
2022-12-30  0.632094  0.787459 -0.043460  0.590284  A
2022-12-31 -0.008297  1.336190  0.832503 -0.816102  A
2023-01-01  0.080573  0.363952 -0.094476  0.896589  A
2023-01-02 -0.553000  0.641742  2.100417  0.314088  A
2023-01-03  0.601046 -0.601035  1.388087  1.454556  A

## B. 외부변수를 이용

`-` 예시

In [205]:
mean = df.A.mean()
mean

-0.2510087711727323

In [206]:
df.query('A > @mean')

                   A         B         C         D
2022-12-28 -0.011607  0.927334 -0.753145  1.013249
2023-01-01  0.958028 -0.015302  0.891259 -0.826834
2023-01-02  1.822226 -1.258543 -0.705506 -0.519831
2023-01-04 -0.083539  0.528519  0.051522  0.126757
2023-01-06 -0.016530  1.041946  1.511319 -0.970646
2023-01-08  0.554734  0.712753  0.769650  0.277420
2023-01-10  0.904037 -0.809864  0.473510 -0.047875
2023-01-12  0.054391 -0.732693  0.409205 -1.165549
2023-01-13  0.053472  0.800553 -0.040499 -0.447199

## C. Index로 query

`-` 예시

In [217]:
df.query('index <= "2022-12-30" or index == "2023-01-10"')

                   A         B         C         D
2022-12-26 -0.259429  0.369731 -0.279944  0.099409
2022-12-27 -0.932515 -0.311629  0.828348 -0.225257
2022-12-28 -0.011607  0.927334 -0.753145  1.013249
2022-12-29 -1.050379 -0.323094  0.813898  1.035724
2022-12-30 -0.921175  0.513109 -0.905361  0.893707
2023-01-10  0.904037 -0.809864  0.473510 -0.047875

# 5. Pandas: 할당

`-` 자료

In [219]:
np.random.seed(43052)
att = np.random.choice(np.arange(10,21)*5,20)
rep = np.random.choice(np.arange(5,21)*5,20)
mid = np.random.choice(np.arange(0,21)*5,20)
fin = np.random.choice(np.arange(0,21)*5,20)
df = pd.DataFrame({'att':att,'rep':rep,'mid':mid,'fin':fin})
df

    att  rep  mid  fin
0    65   55   50   40
1    95  100   50   80
2    65   90   60   30
3    55   80   75   80
4    80   30   30  100
5    75   40  100   15
6    65   45   45   90
7    60   60   25    0
8    95   65   20   10
9    90   80   80   20
10   55   75   35   25
11   95   95   45    0
12   95   55   15   35
13   50   80   40   30
14   50   55   15   85
15   95   30   30   95
16   50   50   45   10
17   65   55   15   45
18   70   70   40   35
19   90   90   80   90

## A. `df.assign()`

`-` 방법1: assign을 이용한 추가

In [220]:
df.assign(total = df.att*0.1 + df.rep*0.2 + df.mid*0.35 + df.fin*0.35)

    att  rep  mid  fin  total
0    65   55   50   40  49.00
1    95  100   50   80  75.00
2    65   90   60   30  56.00
3    55   80   75   80  75.75
4    80   30   30  100  59.50
5    75   40  100   15  55.75
6    65   45   45   90  62.75
7    60   60   25    0  26.75
8    95   65   20   10  33.00
9    90   80   80   20  60.00
10   55   75   35   25  41.50
11   95   95   45    0  44.25
12   95   55   15   35  38.00
13   50   80   40   30  45.50
14   50   55   15   85  51.00
15   95   30   30   95  59.25
16   50   50   45   10  34.25
17   65   55   15   45  38.50
18   70   70   40   35  47.25
19   90   90   80   90  86.50

> 이 방법은 df를 일시적으로 변화시킴

## B. `df.eval()`

`-` 방법2: eval을 이용한 추가

In [221]:
df.eval('total = att*0.1 + rep*0.2 + mid*0.3 + fin*0.4')

    att  rep  mid  fin  total
0    65   55   50   40   48.5
1    95  100   50   80   76.5
2    65   90   60   30   54.5
3    55   80   75   80   76.0
4    80   30   30  100   63.0
5    75   40  100   15   51.5
6    65   45   45   90   65.0
7    60   60   25    0   25.5
8    95   65   20   10   32.5
9    90   80   80   20   57.0
10   55   75   35   25   41.0
11   95   95   45    0   42.0
12   95   55   15   35   39.0
13   50   80   40   30   45.0
14   50   55   15   85   54.5
15   95   30   30   95   62.5
16   50   50   45   10   32.5
17   65   55   15   45   40.0
18   70   70   40   35   47.0
19   90   90   80   90   87.0

> 이 방법은 df를 일시적으로 변화시킴

## C. `df[colname] = xxx`

`-` 방법3: `df['total']` 을 이용한 할당

In [183]:
df['total'] = df.att*0.1 + df.rep*0.2 + df.mid*0.3 + df.fin*0.4
df

    att  rep  mid  fin  total
0    65   55   50   40   48.5
1    95  100   50   80   76.5
2    65   90   60   30   54.5
3    55   80   75   80   76.0
4    80   30   30  100   63.0
5    75   40  100   15   51.5
6    65   45   45   90   65.0
7    60   60   25    0   25.5
8    95   65   20   10   32.5
9    90   80   80   20   57.0
10   55   75   35   25   41.0
11   95   95   45    0   42.0
12   95   55   15   35   39.0
13   50   80   40   30   45.0
14   50   55   15   85   54.5
15   95   30   30   95   62.5
16   50   50   45   10   32.5
17   65   55   15   45   40.0
18   70   70   40   35   47.0
19   90   90   80   90   87.0

> 이 방법은 df를 영구적으로 변화시킴

# 6. HW

`-` 문제: 아래의 자료에서 입학년도를 추가하고 싶다면?

In [184]:
np.random.seed(43052)
att = np.random.choice(np.arange(10,21)*5,20)
rep = np.random.choice(np.arange(5,21)*5,20)
mid = np.random.choice(np.arange(0,21)*5,20)
fin = np.random.choice(np.arange(0,21)*5,20)
student_id = [ '2023-12362', '2022-12471', '2023-12333', '2022-12400', '2022-12377',
               '2022-12469', '2023-12314', '2022-12363', '2023-12445', '2023-12336',
               '2023-12426', '2022-12380', '2023-12422', '2022-12488', '2022-12370',
               '2023-12443', '2022-12463', '2023-12491', '2023-12340', '2022-12312' ]
df = pd.DataFrame({'student_id':student_id,'att':att,'rep':rep,'mid':mid,'fin':fin})
df.head()

   student_id  att  rep  mid  fin
0  2023-12362   65   55   50   40
1  2022-12471   95  100   50   80
2  2023-12333   65   90   60   30
3  2022-12400   55   80   75   80
4  2022-12377   80   30   30  100

In [185]:
df.assign(year=[l.split('-')[0] for l in df.student_id]).query('year=="2022"')

    student_id  att  rep  mid  fin  year
1   2022-12471   95  100   50   80  2022
3   2022-12400   55   80   75   80  2022
4   2022-12377   80   30   30  100  2022
5   2022-12469   75   40  100   15  2022
7   2022-12363   60   60   25    0  2022
11  2022-12380   95   95   45    0  2022
13  2022-12488   50   80   40   30  2022
14  2022-12370   50   55   15   85  2022
16  2022-12463   50   50   45   10  2022
19  2022-12312   90   90   80   90  2022

# 3. `map(function, list)`

## A. `lambda`

`-` 예시1: $x \to x+2$

In [3]:
f = lambda x: x+2 
f(3)

5

`-` 예시2: $x,y \to x+y$

In [4]:
f = lambda x,y: x+y 
f(3,5)

8

`-` 예시3: '2023-09' $\to$ 9

In [16]:
int('2023-09'[-2:])

9

In [17]:
f = lambda x: int(x[-2:])
f('2023-09')

9

In [18]:
f('2022-10')

10

`-` 예시4: '2023-09' $\to$ 2023,9

In [21]:
f = lambda x: (int(x[:4]),int(x[-2:]))
f('2023-09')

(2023, 9)

`-` 예시5: 문자열이 'cat'이면 1 'dog' 이면 0

In [23]:
f = lambda x: 1 if x=='cat' else 0

In [25]:
f('cat'),f('dog')

(1, 0)